RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rdcm.h
/*!
    \file    gd32h77x_78x_rdcm.h
    \brief   definitions for the RDCM

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_78X_RDCM_H
#define GD32H77X_78X_RDCM_H

#include "gd32h77x_78x.h"

/* RDCM definitions */
#define RDCM                             RDCM_BASE                                 /*!< RDCM base address */

/* registers definitions */
#define RDCM_CS                          REG32((RDCM) + 0x00000000U)               /*!< Control and status register*/
#define RDCM_CTL                         REG32((RDCM) + 0x00000004U)               /*!< Control register */
#define RDCM_EXCFG0                      REG32((RDCM) + 0x00000008U)               /*!< Excitor configuration register 0 */
#define RDCM_EXCFG1                      REG32((RDCM) + 0x0000000CU)               /*!< Excitor configuration register 1 */
#define RDCM_HFCFG0                      REG32((RDCM) + 0x00000010U)               /*!< High pass filter configuration register 0 */
#define RDCM_HFCFG1                      REG32((RDCM) + 0x00000014U)               /*!< High pass filter configuration register 1 */
#define RDCM_RFMCFG0                     REG32((RDCM) + 0x00000018U)               /*!< Reference frequency mixer configuration register 0 */
#define RDCM_RFMCFG1                     REG32((RDCM) + 0x0000001CU)               /*!< Reference frequency mixer configuration register 1 */
#define RDCM_ZTCFG0                      REG32((RDCM) + 0x00000020U)               /*!< Zero crossing threshold configuration register 0 */
#define RDCM_ZTCFG1                      REG32((RDCM) + 0x00000024U)               /*!< Zero crossing threshold configuration register 1 */
#define RDCM_MCACFG                      REG32((RDCM) + 0x00000028U)               /*!< Mismatch counter average configuration register */
#define RDCM_DEMCFG                      REG32((RDCM) + 0x0000002CU)               /*!< Demodulator configuration register */
#define RDCM_CSGCFG0                     REG32((RDCM) + 0x00000030U)               /*!< CIC3 shift and gain configuration register 0 */
#define RDCM_CSGCFG1                     REG32((RDCM) + 0x00000034U)               /*!< CIC3 shift and gain configuration register 1 */
#define RDCM_CICCFG0                     REG32((RDCM) + 0x00000038U)               /*!< CIC3 configuration register 0 */
#define RDCM_CICCFG1                     REG32((RDCM) + 0x0000003CU)               /*!< CIC3 configuration register 1 */
#define RDCM_CDCNT                       REG32((RDCM) + 0x00000040U)               /*!< CIC3 decimation counter register */
#define RDCM_NPMCFG                      REG32((RDCM) + 0x00000044U)               /*!< Nonorthogonal phase mismatch configuration register */
#define RDCM_TRKGAINCFG                  REG32((RDCM) + 0x00000048U)               /*!< Tracking gain configuration register */
#define RDCM_TRKINTCFG                   REG32((RDCM) + 0x0000004CU)               /*!< Tracking integrator gain configuration register */
#define RDCM_TRKCMPCFG                   REG32((RDCM) + 0x00000050U)               /*!< Tracking compensation configuration register */
#define RDCM_VSFCFG                      REG32((RDCM) + 0x00000054U)               /*!< Velocity smooth filter configuration register */
#define RDCM_HFDATA                      REG32((RDCM) + 0x00000058U)               /*!< High pass filter data register */
#define RDCM_RFMDATA                     REG32((RDCM) + 0x0000005CU)               /*!< Reference frequency mixer data register */
#define RDCM_DEMDATA                     REG32((RDCM) + 0x00000060U)               /*!< Demodulator data register */
#define RDCM_TRKDATA                     REG32((RDCM) + 0x00000064U)               /*!< Tracking data register */
#define RDCM_MONDATA                     REG32((RDCM) + 0x00000068U)               /*!< Monitor data register */
#define RDCM_TSCTL                       REG32((RDCM) + 0x0000006CU)               /*!< Timestamp control register */
#define RDCM_TSDATA                      REG32((RDCM) + 0x00000070U)               /*!< Timestamp status register */
#define RDCM_FIFOCS                      REG32((RDCM) + 0x00000074U)               /*!< FIFO control register */
#define RDCM_FIFODATA                    REG32((RDCM) + 0x00000078U)               /*!< FIFO data register */
#define RDCM_ETHCFG0                     REG32((RDCM) + 0x0000007CU)               /*!< Envelope threshold configuration register 0 */
#define RDCM_ETHCFG1                     REG32((RDCM) + 0x00000080U)               /*!< Envelope threshold configuration register 1 */
#define RDCM_MTHCFG                      REG32((RDCM) + 0x00000084U)               /*!< Monitor signal threshold configuration register */
#define RDCM_TRKERRTHCFG                 REG32((RDCM) + 0x00000088U)               /*!< Tracking error signal threshold configuration register */
#define RDCM_THCNT                       REG32((RDCM) + 0x0000008CU)               /*!< RDCM tracking threshold match counter register */
#define RDCM_SIMDI                       REG32((RDCM) + 0x00000100U)               /*!< RDCM software data input register */
#define RDCM_DISWSEL                     REG32((RDCM) + 0x00000104U)               /*!< RDCM Data input software selection register */
#define RDCM_PWMCFG                      REG32((RDCM) + 0x00000108U)               /*!< RDCM PWM configuration register */
#define RDCM_POSDATA                     REG32((RDCM) + 0x0000010CU)               /*!< RDCM position data register */
#define RDCM_VELDATA                     REG32((RDCM) + 0x00000110U)               /*!< RDCM velocity data register */

