RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rdcm.h
/* RDCM_DEMDATA */
#define RDCM_DEMDATA_IDEMDATA            BITS(0,15)                                /*!< Data output from I channel phase sensitive demodulator */
#define RDCM_DEMDATA_QDEMDATA            BITS(16,31)                               /*!< Data output from Q channel phase sensitive demodulator */

/* RDCM_TRKDATA */
#define RDCM_TRKDATA_VELOCITY            BITS(0,15)                                /*!< Velocity data */
#define RDCM_TRKDATA_POSITION            BITS(16,31)                               /*!< Position data */

/* RDCM_MONDATA */
#define RDCM_MONDATA_TRKERRDATA          BITS(0,15)                                /*!< Tracking error signal data */
#define RDCM_MONDATA_MONDATA             BITS(16,31)                               /*!< Monitor signal data */

/* RDCM_TSCTL */
#define RDCM_TSCTL_TSCNT                 BITS(0,15)                                /*!< Timestamp counter value */
#define RDCM_TSCTL_TSCLK                 BITS(16,17)                               /*!< Timestamp counter clock selection */

/* RDCM_TSDATA */
#define RDCM_TSDATA_TSVAL                BITS(0,15)                                /*!< The most recent captured timestamp value */
#define RDCM_TSDATA_TSTRGF               BIT(31)                                   /*!< Timestamp information valid flag */

/* RDCM_FIFOCS */
#define RDCM_FIFOCS_FIFOESEL             BITS(0,1)                                 /*!< FIFO result event selection */
#define RDCM_FIFOCS_FIFOFH               BIT(2)                                    /*!< FIFO reset */
#define RDCM_FIFOCS_FIFONUM              BITS(16,18)                               /*!< FIFO valid data number */
#define RDCM_FIFOCS_RERRF                BIT(19)                                   /*!< Read error flag */
#define RDCM_FIFOCS_WERRF                BIT(20)                                   /*!< Write error flag */

/* RDCM_FIFODATA */
#define RDCM_FIFODATA_FIFODATA           BITS(0,31)                                /*!< FIFO read data */

/* RDCM_ETHCFG0 */
#define RDCM_ETHCFG0_IETHL               BITS(0,14)                                /*!< Lower threshold for envelope signal of I channel */
#define RDCM_ETHCFG0_IETHU               BITS(16,30)                               /*!< Upper threshold for envelope signal of I channel */

/* RDCM_ETHCFG1 */
#define RDCM_ETHCFG1_QETHL               BITS(0,14)                                /*!< Lower threshold for envelope signal of Q channel */
#define RDCM_ETHCFG1_QETHU               BITS(16,30)                               /*!< Upper threshold for envelope signal of Q channel */

/* RDCM_MTHCFG */
#define RDCM_MTHCFG_MTHL                 BITS(0,14)                                /*!< Lower threshold for monitor signal */
#define RDCM_MTHCFG_MTHU                 BITS(16,30)                               /*!< Upper threshold for monitor signal */

/* RDCM_TRKERRTHCFG */
#define RDCM_TRKERRTHCFG_TRKERRTHL       BITS(0,14)                                /*!< Lower threshold for tracking error signal */
#define RDCM_TRKERRTHCFG_TRKERRTHU       BITS(16,30)                               /*!< Upper threshold for tracking error signal */

/* RDCM_THCNT */
#define RDCM_THCNT_TRKERRTHCNT           BITS(0,13)                                /*!< The tracking error signal threshold match counter value */
#define RDCM_THCNT_MTHCNT                BITS(16,29)                               /*!< The monitor signal threshold match counter value */

/* RDCM_SIMDI */
#define RDCM_SIMDI_ISIMDI                BITS(0,13)                                /*!< Software I channel Data input */
#define RDCM_SIMDI_QSIMDI                BITS(16,29)                               /*!< Software Q channel Data input */

/* RDCM_DISWSEL */
#define RDCM_DISWSEL_DISEL               BIT(0)                                    /*!< RDC data software selection */
#define RDCM_DISWSEL_ISIGNSEL            BIT(1)                                    /*!< I channel RDC frequency mixer reference sign source selection */
#define RDCM_DISWSEL_QSIGNSEL            BIT(17)                                   /*!< Q channel RDC frequency mixer reference sign source selection */

/* RDCM_PWMCFG */
#define RDCM_PWMCFG_PWMGAIN              BITS(0,13)                                /*!< Gain adjust config for PWM value (PWMVAL) */
#define RDCM_PWMCFG_PWMOFFSET            BITS(16,29)                               /*!< PWM offset adjust config for PWM value (PWMVAL) */
#define RDCM_PWMCFG_BREVM                BIT(30)                                   /*!< Bit-reversed mode for PWM value (PWMVAL) */
#define RDCM_PWMCFG_PWMEN                BIT(31)                                   /*!< PWM waveform generator enable */

/* RDCM_POSDATA */
#define RDCM_POSDATA_POSITION            BITS(0,15)                                /*!< Position data */

/* RDCM_VELDATA */
#define RDCM_VELDATA_VELOCITY            BITS(0,15)                                /*!< Velocity data */

/* constants definitions */
/* RDCM main chain calculation event selection */
#define CALSEL(regval)                  (BITS(1,2) & ((uint32_t)(regval) << 1))
#define RDCM_CALSEL_ADC0                CALSEL(0)                                  /*!< ADC0 end of conversion event */
#define RDCM_CALSEL_ADC1                CALSEL(1)                                  /*!< ADC1 end of conversion event */
#define RDCM_CALSEL_ADC0_OR_ADC1        CALSEL(2)                                  /*!< ADC0 or ADC1 end of conversion event */
#define RDCM_CALSEL_EXTERNAL_TRIGGER    CALSEL(3)                                  /*!< external trigger from TRIGSEL for RDC main chain calculation */

/* gate signal valid selection */
#define GATEVSEL(regval)                (BITS(3,4) & ((uint32_t)(regval) << 3))
#define RDCM_GATEVSEL_ALWAYS_VALID      GATEVSEL(0)                                /*!< always valid */
#define RDCM_GATEVSEL_HIGH_VALID        GATEVSEL(1)                                /*!< valid level is high */
#define RDCM_GATEVSEL_LOW_VALID         GATEVSEL(2)                                /*!< valid level is low */

