RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rdcm.h
/* external trigger mode for RDCM main chain calculation */
#define CALETM(regval)                  (BITS(5,6) & ((uint32_t)(regval) << 5))
#define RDCM_CALETM_DISABLE             CALETM(0)                                  /*!< disable trigger for RDCM main chain calculation */
#define RDCM_CALETM_RISING              CALETM(1)                                  /*!< rising edge of external trigger for RDCM main chain calculation */
#define RDCM_CALETM_FALLING             CALETM(2)                                  /*!< falling edge of external trigger for RDCM main chain calculation */
#define RDCM_CALETM_BOTH                CALETM(3)                                  /*!< rising and falling edge of external trigger for RDCM main chain calculation */

/* I channel high-pass filter mode */
#define IHFM(regval)                    (BITS(16,18) & ((uint32_t)(regval) << 16))
#define RDCM_IHFM_DISABLE               IHFM(0)                                    /*!< offset compensation filter disabled */
#define RDCM_IHFM_RATE1                 IHFM(1)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 1 */
#define RDCM_IHFM_RATE2                 IHFM(2)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 2 */
#define RDCM_IHFM_RATE3                 IHFM(3)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 3 */
#define RDCM_IHFM_RATE4                 IHFM(4)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 4 */
#define RDCM_IHFM_RATE5                 IHFM(5)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 5 */
#define RDCM_IHFM_RATE6                 IHFM(6)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 6 */
#define RDCM_IHFM_RATE7                 IHFM(7)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 7 */

/* Q channel high-pass filter mode */
#define QHFM(regval)                    (BITS(16,18) & ((uint32_t)(regval) << 16))
#define RDCM_QHFM_DISABLE               QHFM(0)                                    /*!< offset compensation filter disabled */
#define RDCM_QHFM_RATE1                 QHFM(1)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 1 */
#define RDCM_QHFM_RATE2                 QHFM(2)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 2 */
#define RDCM_QHFM_RATE3                 QHFM(3)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 3 */
#define RDCM_QHFM_RATE4                 QHFM(4)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 4 */
#define RDCM_QHFM_RATE5                 QHFM(5)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 5 */
#define RDCM_QHFM_RATE6                 QHFM(6)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 6 */
#define RDCM_QHFM_RATE7                 QHFM(7)                                    /*!< enable offset compensation filter, set cutoff frequency to rate 7 */

/* timestamp counter clock selection */
#define TSCLK(regval)                   (BITS(16,17) & ((uint32_t)(regval) << 16))
#define RDCM_TSCLK_DIV1                 TSCLK(0)                                   /*!< fTS = fRDCM */
#define RDCM_TSCLK_DIV2                 TSCLK(1)                                   /*!< fTS = fRDCM / 2 */
#define RDCM_TSCLK_DIV4                 TSCLK(2)                                   /*!< fTS = fRDCM / 4 */
#define RDCM_TSCLK_DIV8                 TSCLK(3)                                   /*!< fTS = fRDCM / 8 */

/* FIFO result event selection */
#define FIFOESEL(regval)                (BITS(0,1) & ((uint32_t)(regval)))
#define RDCM_FIFOESEL_1VALUE            FIFOESEL(0)                                /*!< generate result data event when FIFO contains 1 value */
#define RDCM_FIFOESEL_2VALUE            FIFOESEL(1)                                /*!< generate result data event when FIFO contains 2 values */
#define RDCM_FIFOESEL_3VALUE            FIFOESEL(2)                                /*!< generate result data event when FIFO contains 3 values */
#define RDCM_FIFOESEL_4VALUE            FIFOESEL(3)                                /*!< generate result data event when FIFO contains 4 values */

/* RDCM DMA disable mode */
#define RDCM_DDSM_AFTER_TRANSFER        ((uint32_t)0x00000000U)                    /*!< the DMA engine is disabled after the end of transfer signal from DMA controller is detected */
#define RDCM_DDSM_REQUEST_ENABLED       ((uint32_t)0x40000000U)                    /*!< when DMAEN=1, the DMA issues a request according to result data transfer setting */

/* RDCM FIFO flush */
#define RDCM_FIFO_FLUSH                 BIT(2)                                     /*!< remove all values from result FIFO */

/* RDCM data input selection */
#define RDCM_DISEL_ADC                  ((uint32_t)0x00000000U)                    /*!< RDCM I/Q channel calculation use ADC conversion data */
#define RDCM_DISEL_SIMULATION           ((uint32_t)0x00000001U)                    /*!< RDCM I/Q channel calculation use ISIMDI[13:0] and QSIMDI[13:0] */

/* RDCM I/Q channel frequency mixer reference sign source selection */
#define RDCM_ISIGNSEL_INTERNAL          ((uint32_t)0x00000000U)                    /*!< use on-chip excitor sign as I channel RDCM frequency mixer reference */
#define RDCM_ISIGNSEL_EXTERNAL          ((uint32_t)0x00000002U)                    /*!< use external excitor sign signal pin input as I channel RDCM frequency mixer reference */
#define RDCM_QSIGNSEL_INTERNAL          ((uint32_t)0x00000000U)                    /*!< use on-chip excitor sign as Q channel RDCM frequency mixer reference */
#define RDCM_QSIGNSEL_EXTERNAL          ((uint32_t)0x00020000U)                    /*!< use external excitor sign signal pin input as Q channel RDCM frequency mixer reference */

