RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rdcm.h
/* RDCM PWM bit-reversed mode */
#define RDCM_BREVM_NORMAL               ((uint32_t)0x00000000U)                    /*!< normal mode for PWM value */
#define RDCM_BREVM_BIT_REVERSED         ((uint32_t)0x40000000U)                    /*!< bit-reversed mode for PWM value */

#define RDCM_EXC_DISABLE                ((uint32_t)0x00000000U)
#define RDCM_EXC_ENABLE                 ((uint32_t)0x02000000U)

#define RDCM_PWM_DISABLE                ((uint32_t)0x00000000U)
#define RDCM_PWM_ENABLE                 ((uint32_t)0x80000000U)

#define RDCM_RFM_DISABLE                ((uint32_t)0x00000000U)
#define RDCM_RFM_ENABLE                 ((uint32_t)0x00000001U)

#define RDCM_DEM_DISABLE                ((uint32_t)0x00000000U)
#define RDCM_DEM_ENABLE                 ((uint32_t)0x00000002U)

#define RDCM_FIR0_DISABLE               ((uint32_t)0x00000000U)
#define RDCM_FIR0_ENABLE                ((uint32_t)0x00000001U)

#define RDCM_FIR1_DISABLE               ((uint32_t)0x00000000U)
#define RDCM_FIR1_ENABLE                ((uint32_t)0x00000002U)

#define RDCM_CIC3_DISABLE               ((uint32_t)0x00000000U)
#define RDCM_CIC3_ENABLE                ((uint32_t)0x00000008U)

#define RDCM_FIR1_DEC_2                 ((uint32_t)0x00000000U)
#define RDCM_FIR1_DEC_1                 ((uint32_t)0x00000004U)

#define RDCM_TRK_DISABLE                ((uint32_t)0x00000000U)
#define RDCM_TRK_ENABLE                 ((uint32_t)0x04000000U)

#define RDCM_CHANNEL_I                  ((uint32_t)0x00000000U)
#define RDCM_CHANNEL_Q                  ((uint32_t)0x00000001U)

/* RDCM interrupt enable or disable */
#define RDCM_INTEN_MASK                 ((uint32_t)0x0000FF80U)
#define RDCM_INT_TRKERRTHM              RDCM_CS_TRKERRTHMIE                          /*!< track error signal threshold match interrupt enable */
#define RDCM_INT_MTH                    RDCM_CS_MTHIE                                /*!< monitor signal threshold match interrupt enable */
#define RDCM_INT_QETHM                  RDCM_CS_QETHMIE                              /*!< Q channel envelope signal threshold match interrupt enable */
#define RDCM_INT_IETHM                  RDCM_CS_IETHMIE                              /*!< I channel envelope signal threshold match interrupt enable */
#define RDCM_INT_QZCD                   RDCM_CS_QZCDIE                               /*!< Q channel zero crossing detection valid interrupt enable */
#define RDCM_INT_IZCD                   RDCM_CS_IZCDIE                               /*!< I channel zero crossing detection valid interrupt enable */
#define RDCM_INT_TSCAP                  RDCM_CS_TSCAPIE                              /*!< timestamp counter capture valid interrupt enable */
#define RDCM_INT_DMAOV                  RDCM_CS_OVIE                                 /*!< RDC-DMA transfer overflow interrupt enable */
#define RDCM_INT_RESDATA                RDCM_CS_RESDIE                               /*!< result valid (Result update or result fifo level) interrupt enable */

/* RDCM interrupt flag */
#define RDCM_INT_FLAG_MASK              ((uint32_t)0xFF800000U)
#define RDCM_INT_FLAG_TRKERRTHM         RDCM_CS_TRKERRTHMIF                          /*!< track error signal threshold match interrupt flag */
#define RDCM_INT_FLAG_MTH               RDCM_CS_MTHMIF                               /*!< monitor signal threshold match interrupt flag */
#define RDCM_INT_FLAG_QETHM             RDCM_CS_QETHMIF                              /*!< Q channel envelope signal threshold match interrupt flag */
#define RDCM_INT_FLAG_IETHM             RDCM_CS_IETHMIF                              /*!< I channel envelope signal threshold match interrupt flag */
#define RDCM_INT_FLAG_QZCD              RDCM_CS_QZCDIF                               /*!< Q channel zero crossing detection interrupt flag */
#define RDCM_INT_FLAG_IZCD              RDCM_CS_IZCDIF                               /*!< I channel zero crossing detection interrupt flag */
#define RDCM_INT_FLAG_TSCAP             RDCM_CS_TSCAPIF                              /*!< timestamp counter capture interrupt flag */
#define RDCM_INT_FLAG_DMAOV             RDCM_CS_OVIF                                 /*!< DMA transfer data register overflow interrupt flag */
#define RDCM_INT_FLAG_RESDATA           RDCM_CS_RESDIF                               /*!< result data interrupt flag */

/* RDCM flag */
/* define the RDCM  bit position and its register index offset */
#define RDCM_REG_VAL(offset)              (REG32((RDCM_BASE) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define RDCM_BIT_POS(val)                 ((uint32_t)(val) & 0x0000001FU)
#define RDCM_REGIDX_BIT(regidx, bitpos)   (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))

#define RDCM_CS_OFFSET                  ((uint32_t)0x00000000U)
#define RDCM_TSDATA_OFFSET              ((uint32_t)0x00000070U)
#define RDCM_FIFOCS_OFFSET              ((uint32_t)0x00000074U)


typedef enum {
    RDCM_FLAG_TRKERRTHM = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 23U),                      /*!< track error signal threshold match interrupt flag */
    RDCM_FLAG_MTH = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 24U),                            /*!< monitor signal threshold match interrupt flag */
    RDCM_FLAG_QETHM = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 25U),                          /*!< Q channel envelope signal threshold match interrupt flag */
    RDCM_FLAG_IETHM = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 26U),                          /*!< I channel envelope signal threshold match interrupt flag */
    RDCM_FLAG_QZCD = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 27U),                           /*!< Q channel zero crossing detection interrupt flag */
    RDCM_FLAG_IZCD = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 28U),                           /*!< I channel zero crossing detection interrupt flag */
    RDCM_FLAG_TSCAP = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 29U),                          /*!< timestamp counter capture interrupt flag */
    RDCM_FLAG_DMAOV = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 30U),                          /*!< DMA transfer data register overflow interrupt flag */
    RDCM_FLAG_RESDATA = RDCM_REGIDX_BIT(RDCM_CS_OFFSET, 31U),                        /*!< result data interrupt flag */
    RDCM_FLAG_TSTRG = RDCM_REGIDX_BIT(RDCM_TSDATA_OFFSET, 31U),                      /*!< timestamp trigger flag */
    RDCM_FLAG_RERR = RDCM_REGIDX_BIT(RDCM_FIFOCS_OFFSET, 19U),                       /*!< FIFO read error flag */
    RDCM_FLAG_WERR = RDCM_REGIDX_BIT(RDCM_FIFOCS_OFFSET, 20U),                       /*!< FIFO write error flag */
}rdcm_flag_enum;

/* RDCM trigger parameter struct definitions */
typedef struct
{
    uint32_t nco_trigger_sel;                                                        /*!< NCOs trigger selection */
    uint32_t cal_trigger_sel;                                                        /*!< RDCM main chain calculation event selection */
    uint32_t cal_trigger_edge;                                                       /*!< external trigger mode for RDCM main chain calculation */
}rdcm_trigger_parameter_struct;

/* RDCM excitor output parameter struct definitions */
typedef struct
{
    uint32_t exc_en;                                                                 /*!< excitor enable */
    uint32_t exc_fre;                                                                /*!< excitor frequency factor */
    uint32_t exc_div;                                                                /*!< excitor calculation frequency division */
    uint32_t exc_phase;                                                              /*!< excitor initial phase factor */
    uint32_t exc_amp;                                                                /*!< excitor amplitude */
}rdcm_excitor_output_parameter_struct;

/* RDCM reference frequency mixer parameter struct definitions */
typedef struct
{
    uint32_t i_rfm_en;                                                               /*!< reference frequency mixer enable */
    uint32_t i_zc_mode;                                                              /*!< zero-crossing mode */
    uint32_t i_hf_mode;                                                              /*!< high pass filter mode */
    uint32_t i_rfm_fre;                                                              /*!< the frequency control word of the I channel reference frequency mixer */
    uint32_t i_rfm_phase;                                                            /*!< initial phase of the I channel reference frequency mixer */
    uint32_t i_zc_th;                                                                /*!< the threshold of mismatch counter value in zero crossing detection */
    uint32_t i_zc_th_var;                                                            /*!< the threshold variation range of mismatch counter value in zero crossing detection */
    uint32_t i_average;                                                              /*!< the mismatch counter average factor */
    uint32_t q_rfm_en;                                                               /*!< reference frequency mixer enable */
    uint32_t q_zc_mode;                                                              /*!< zero-crossing mode */
    uint32_t q_hf_mode;                                                              /*!< high pass filter mode */
    uint32_t q_rfm_fre;                                                              /*!< the frequency control word of the Q channel reference frequency mixer */
    uint32_t q_rfm_phase;                                                            /*!< initial phase of the Q channel reference frequency mixer */
    uint32_t q_zc_th;                                                                /*!< the threshold of mismatch counter value in zero crossing detection */
    uint32_t q_zc_th_var;                                                            /*!< the threshold variation range of mismatch counter value in zero crossing detection */
    uint32_t q_average;                                                              /*!< the mismatch counter average factor */
}rdcm_rfm_parameter_struct;

/* RDCM demodulator parameter struct definitions */
typedef struct
{
    uint32_t i_dem_en;                                                               /*!< I channel demodulator enable */
    uint32_t i_fir0_en;                                                              /*!< I channel FIR0 filter enable */
    uint32_t i_fir1_en;                                                              /*!< I channel FIR1 filter enable */
    uint32_t i_fir1_dec;                                                             /*!< I channel FIR1 filter decimation rate */
    uint32_t i_cic3_en;                                                              /*!< I channel CIC3 filter enable */
    uint32_t i_cic3_shift;                                                           /*!< I channel output shift */
    uint32_t i_cic3_gain;                                                            /*!< I channel gain factor */
    uint32_t i_cic3_dec;                                                             /*!< I channel CIC filter decimation factor */
    uint32_t i_cic3_val;                                                             /*!< I channel CIC filter start value */
    uint32_t q_dem_en;                                                               /*!< Q channel demodulator enable */
    uint32_t q_fir0_en;                                                              /*!< Q channel FIR0 filter enable */
    uint32_t q_fir1_en;                                                              /*!< Q channel FIR1 filter enable */
    uint32_t q_fir1_dec;                                                             /*!< Q channel FIR1 filter decimation rate */
    uint32_t q_cic3_en;                                                              /*!< Q channel CIC3 filter enable */
    uint32_t q_cic3_shift;                                                           /*!< Q channel output shift */
    uint32_t q_cic3_gain;                                                            /*!< Q channel gain factor */
    uint32_t q_cic3_dec;                                                             /*!< Q channel CIC filter decimation factor */
    uint32_t q_cic3_val;                                                             /*!< Q channel CIC filter start value */
}rdcm_demodulator_parameter_struct;

/* RDCM track loop parameter struct definitions */
typedef struct
{
    uint32_t trk_en;                                                                 /*!< track loop enable */
    uint32_t npm_x;                                                                  /*!< Q channel nonorthogonal phase mismatch compensation factor X */
    uint32_t npm_y;                                                                  /*!< Q channel nonorthogonal phase mismatch compensation factor Y */
    uint32_t trk_gain;                                                               /*!< the error acceleration gain factor */
    uint32_t position_int_gain;                                                      /*!< the position gain factor of integrator */
    uint32_t velocity_int_gain;                                                      /*!< the velocity gain factor of integrator */
    uint32_t trk_cmp_zero;                                                           /*!< the zero of compensation filter */
    uint32_t trk_cmp_pole;                                                           /*!< the pole of compensation filter */
    uint32_t velocity_smooth_factor;                                                 /*!< velocity smooth filter mode in tracking loop */
}rdcm_track_loop_parameter_struct;

/* RDCM pwm parameter struct definitions */
typedef struct
{
    uint32_t pwm_en;                                                                 /*!< PWM waveform generator enable */
    uint32_t bit_reverse;                                                            /*!< bit-reversed mode for PWM value */
    uint32_t pwm_offset;                                                             /*!< PWM offset for PWM value */
    uint32_t pwm_gain;                                                               /*!< PWM gain for PWM value */
}rdcm_pwm_parameter_struct;

/* function declarations */
/* initialization functions */
/* reset RDCM */
void rdcm_deinit(void);
/* RDCM trigger functions */
/* initialize RDCM trigger parameter struct with a default value */
void rdcm_trigger_parameter_struct_para_init(rdcm_trigger_parameter_struct *initpara);
/* configure RDCM trigger function */
void rdcm_trigger_config(rdcm_trigger_parameter_struct* trigger_para);

/* RDCM excitor functions */
/* initialize RDCM excitor output parameter struct with a default value */
void rdcm_excitor_output_parameter_struct_para_init(rdcm_excitor_output_parameter_struct *initpara);
/* configure RDCM excitor output function */
void rdcm_excitor_output_config(rdcm_excitor_output_parameter_struct* exc_outputpara);
/* initialize RDCM excitor pwm parameter struct with a default value */
void rdcm_pwm_parameter_struct_para_init(rdcm_pwm_parameter_struct *initpara);
/* configure RDCM excitor pwm function */
void rdcm_excitor_pwm_config(rdcm_pwm_parameter_struct* pwm_para);
/* enable RDCM excitor */
void rdcm_excitor_enable(void);
/* disable RDCM excitor */
void rdcm_excitor_disable(void);

/* RDCM reference frequency mixer functions */
/* initialize RDCM reference frequency mixer parameter struct with a default value */
void rdcm_rfm_parameter_struct_para_init(rdcm_rfm_parameter_struct *initpara);
/* configure RDCM reference frequency mixer function */
void rdcm_reference_frequency_mixer_config(rdcm_rfm_parameter_struct* rfm_para);
/* enable RDCM reference frequency mixer */
void rdcm_reference_frequency_mixer_enable(void);
/* disable RDCM reference frequency mixer */
void rdcm_reference_frequency_mixer_disable(void);

/* RDCM demodulator functions */
/* initialize RDCM demodulator parameter struct with a default value */
void rdcm_demodulator_parameter_struct_para_init(rdcm_demodulator_parameter_struct *initpara);
/* configure RDCM demodulator function */
void rdcm_demodulator_config(rdcm_demodulator_parameter_struct* dem_para);
/* enable RDCM demodulator */
void rdcm_demodulator_enable(void);
/* disable RDCM demodulator */
void rdcm_demodulator_disable(void);
/* reset demodulator */
void rdcm_demodulator_reset(uint32_t channel);

/* RDCM track loop functions */
/* initialize RDCM track loop parameter struct with a default value */
void rdcm_track_loop_parameter_struct_para_init(rdcm_track_loop_parameter_struct *initpara);
/* configure RDCM track loop function */
void rdcm_track_loop_config(rdcm_track_loop_parameter_struct* trackloop_para);
/* enable RDCM track loop */
void rdcm_track_loop_enable(void);
/* disable RDCM track loop */
void rdcm_track_loop_disable(void);

/* RDCM basic functions */
/* enable RDCM */
void rdcm_enable(void);
/* disable RDCM */
void rdcm_disable(void);

/* RDCM DMA functions */
/* enable RDCM DMA */
void rdcm_dma_enable(void);
/* disable RDCM DMA */
void rdcm_dma_disable(void);
/* selection RDCM result data register */
void rdcm_result_data_reg_sel(uint32_t reg_sel);
/* configure RDCM DMA engine issues requests according to the RESDIF bit */
void rdcm_dma_request_after_last_enable(void);
/* configure RDCM DMA engine is disabled after the end of transfer signal from DMA controller is detected */
void rdcm_dma_request_after_last_disable(void);
/* enable RDCM dma overflow detection */
void rdcm_dma_overflow_detection_enable(void);
/* disable RDCM dma overflow detection */
void rdcm_dma_overflow_detection_disable(void);

